package ua.khpi.oop.melnik01;

//Завдання:

1. Обрати тип змінних та встановити за допомогою констант та літералів початкові значення:

 - число, що відповідає номеру залікової книжки (через брак використовувати п'ятизначне випадкове число) за допомогою шістнадцяткового літералу;
 - число, що відповідає номеру мобільного телефона (починаючи з 380...) за допомогою десяткового літералу;
 - число, яке складається з останніх двох ненульових цифр номера мобільного телефону за допомогою двійкового літералу;
 - число, яке складається з останніх чотирьох ненульових цифр номера мобільного телефону за допомогою вісімкового літералу;
 - визначити збільшене на одиницю значення залишку від ділення на 26 зменшеного на одиницю номера студента в журналі групи;
 - символ англійського алфавіту в верхньому регістрі, номер якого відповідає знайденому раніше значенню ('A' - 1, 'B' - 2, ... , 'Z' - 26).
 
2. Використовуючи десятковий запис цілочисельного значення кожної змінної знайти і підрахувати кількість парних і непарних цифр.

3. Використовуючи двійковий запис цілочисельного значення кожної змінної підрахувати кількість одиниць.
